{
  "Alakazam": "Run Focus Sash with Magic Guard. Use Psychic, Shadow Ball, Focus Blast, and Encore. Very fast revenge killer.",
  "Snorlax": "CurseLax is viable: Curse, Body Slam, Rest, and Sleep Talk. High bulk and good synergy with walls.",
  "Lapras": "Good in lower tiers with Freeze-Dry, Thunderbolt, Surf, and Perish Song. Great bulk and Ice typing.",
  "Zapdos": "Use Defog, Roost, Discharge, and Heat Wave. Pressure helps stall teams. Good pivot with Boots.",
  "Starmie": "A reliable spinner with Rapid Spin, Recover, Scald, and Thunderbolt or Ice Beam. Natural Cure helps longevity.",
  "Machamp": "Guts Machamp with Dynamic Punch, Knock Off, Bullet Punch, and Facade is a powerful wallbreaker.",
  "Tyranitar": "Set up Sandstorm and use Stealth Rock, Crunch, Rock Slide, and Earthquake. Good special defense.",
  "Metagross": "Tough Claws Mega Metagross with Meteor Mash, Zen Headbutt, Earthquake, and Bullet Punch hits hard.",
  "Salamence": "Use Dragon Dance, Outrage, Earthquake, and Roost with Moxie or Intimidate. Great late-game sweeper.",
  "Blaziken": "Speed Boost with Protect, Swords Dance, Flare Blitz, and High Jump Kick. Banworthy in many formats.",
  "Swampert": "Mega Swampert shines in rain with Waterfall, Earthquake, Ice Punch, and Stealth Rock or Power-Up Punch.",
  "Sceptile": "Mega Sceptile with Leaf Storm, Dragon Pulse, Focus Blast, and Substitute works as a fast special attacker.",
  "Milotic": "Flame Orb Marvel Scale Milotic with Recover, Scald, Haze, and Toxic is a durable special wall.",
  "Lucario": "Use Swords Dance with Close Combat, Extreme Speed, and Crunch. Special variants with Nasty Plot are also strong.",
  "Infernape": "Versatile attacker with Fire Blast, Close Combat, U-turn, and Stealth Rock. Great mixed lead.",
  "Gliscor": "Poison Heal with Toxic, Protect, Earthquake, and Roost. Great staller and physical wall.",
  "Togekiss": "Air Slash + Thunder Wave + Roost creates the dreaded paraflinch combo. Use Serene Grace.",
  "Sylveon": "Wish + Protect with Hyper Voice and Heal Bell. Use Pixilate and Leftovers for team support.",
  "Goodra": "Assault Vest Goodra with Draco Meteor, Sludge Bomb, Fire Blast, and Thunderbolt counters many special attackers.",
  "Decidueye": "Spirit Shackle prevents switches. Pair with Swords Dance, Roost, and Leaf Blade or Shadow Sneak.",
  "Primarina": "Special tank with Sparkling Aria, Moonblast, Calm Mind, and Rest. High SpA and SpDef.",
  "Toxapex": "One of the best walls: use Recover, Haze, Scald, and Toxic Spikes. Regenerator makes it hard to wear down.",
  "Kommo-o": "Use Clangorous Soul with Throat Spray, Boomburst, and Flamethrower or Aura Sphere. Anti-meta sweeper.",
  "Mimikyu": "Disguise gives a free setup turn. Run Swords Dance, Shadow Claw, Play Rough, and Shadow Sneak.",
  "Venusaur": "Use Chlorophyll ability with Sleep Powder, Giga Drain, Sludge Bomb, and Synthesis for a sun-based tank and status spreader.",
  "Blastoise": "Mega Blastoise with Mega Launcher using Water Pulse, Dark Pulse, Aura Sphere, and Ice Beam is a powerful special attacker.",
  "Pidgeot": "Mega Pidgeot with No Guard and Hurricane paired with Rain Dance is a deadly rain sweeper.",
  "Arcanine": "Use Intimidate with Flare Blitz, Extreme Speed, Wild Charge, and Morning Sun or Close Combat for bulky offensive sets.",
  "Jolteon": "Fast special attacker with Volt Switch, Thunderbolt, Shadow Ball, and Signal Beam or Hidden Power Ice.",
  "Gengar": "Mega Gengar is a frail but powerful special attacker with Shadow Ball, Sludge Bomb, Focus Blast, and Destiny Bond or Taunt.",
  "Onix": "Use Stealth Rock, Rock Throw, Toxic, and Roar in hazard stacking roles.",
  "Hypno": "Trick Room setter with Psychic, Thunder Wave, and Rest. Bulk allows it to survive and disrupt.",
  "Gyarados": "Mega Gyarados with Dragon Dance, Waterfall, Crunch, and Ice Fang is a deadly physical sweeper.",
  "Magneton": "Use Magnet Pull to trap Steel-types. Volt Switch, Flash Cannon, Thunder Wave, and Substitute for utility.",
  "Crobat": "Use Brave Bird, Cross Poison, U-turn, and Roost. Great fast pivot and revenge killer.",
  "Roserade": "Toxic Spikes, Sludge Bomb, Giga Drain, and Spikes with Natural Cure or Technician.",
  "Gardevoir": "Mega Gardevoir with Pixilate using Hyper Voice, Psyshock, Focus Blast, and Will-O-Wisp is a special tank and attacker.",
  "Mamoswine": "Use Ice Shard, Earthquake, Icicle Crash, and Stealth Rock or Knock Off for strong physical damage and priority.",
  "Aegislash": "King's Shield, Shadow Ball, Sacred Sword, and Iron Head with Stance Change for offensive and defensive versatility.",
  "Excadrill": "Sand Rush ability under Sandstorm with Earthquake, Iron Head, Rapid Spin, and Swords Dance is very effective.",
  "Hydreigon": "Special attacker with Draco Meteor, Dark Pulse, Flamethrower, and Flash Cannon for coverage.",
  "Tyrantrum": "Physical sweeper with Head Smash, Earthquake, Dragon Dance, and Rock Slide or Ice Fang.",
  "Volcarona": "Quiver Dance sweeper with Fiery Dance, Bug Buzz, Giga Drain, and Roost or Psychic.",
  "Greninja": "Protean ability lets you run Hydro Pump, Dark Pulse, Ice Beam, and U-turn for amazing type coverage.",
  "Talonflame": "Gale Wings gives priority Brave Bird. Use Roost, Swords Dance, and U-turn for support and offense.",
  "Garchomp": "Physical sweeper with Dragon Claw, Earthquake, Fire Fang, and Swords Dance.",
  "Salamence": "Dragon Dance sweeper with Outrage, Earthquake, Fire Fang, and Roost.",
  "Metagross": "Mega Metagross with Meteor Mash, Zen Headbutt, Bullet Punch, and Earthquake for strong physical offense.",
  "Landorus-Therian": "Intimidate support with Earthquake, U-turn, Stealth Rock, and Knock Off.",
  "Ferrothorn": "Use Leech Seed, Protect, Gyro Ball, and Stealth Rock for defensive hazard setting and chip damage.",
  "Rotom-Wash": "Pivot with Volt Switch, Hydro Pump, Will-O-Wisp, and Pain Split.",
  "Toxapex": "Wall with Recover, Toxic, Scald, and Haze.",
  "Lunala": "Special attacker with Moongeist Beam, Psyshock, Focus Blast, and Roost.",
  "Necrozma-Dusk-Mane": "Tanky attacker with Sunsteel Strike, Photon Geyser, Earthquake, and Stealth Rock.",
  "Clefable": "Unaware or Magic Guard Clefable can wall threats. Use Moonblast, Soft-Boiled, Thunder Wave, and Stealth Rock or Calm Mind.",
  "Scizor": "Use Bullet Punch, U-turn, Swords Dance, and Roost with Technician. Mega Scizor is a powerful tank and pivot.",
  "Rotom-Heat": "Pivot with Volt Switch, Overheat, Will-O-Wisp, and Pain Split.",
  "Tyranitar": "Sand Stream ability with Stealth Rock, Crunch, Stone Edge, and Earthquake. Can run Dragon Dance sets.",
  "Hydreigon": "Special sweeper with Draco Meteor, Dark Pulse, Flamethrower, and Earth Power.",
  "Chandelure": "Special attacker with Shadow Ball, Flamethrower, Energy Ball, and Will-O-Wisp.",
  "Aegislash": "King’s Shield for protection and form change, Shadow Ball, Sacred Sword, and Shadow Sneak for offense.",
  "Garchomp": "Physical sweeper with Dragon Claw, Earthquake, Fire Fang, and Swords Dance.",
  "Togekiss": "Para-flinch with Air Slash, Thunder Wave, Roost, and Aura Sphere.",
  "Mimikyu": "Disguise allows a free setup turn. Use Swords Dance, Shadow Claw, Play Rough, and Shadow Sneak.",
  "Mega Lucario": "Swords Dance, Close Combat, Extreme Speed, and Iron Tail or Bullet Punch.",
  "Blissey": "Special wall with Soft-Boiled, Seismic Toss, Thunder Wave, and Aromatherapy or Heal Bell.",
  "Golisopod": "Emergency Exit ability with First Impression, Liquidation, Sucker Punch, and Leech Life.",
  "Rillaboom": "Grassy Surge ability with Grassy Terrain, Drum Beating, U-turn, and Knock Off.",
  "Cinderace": "Libero ability with Pyro Ball, High Jump Kick, Sucker Punch, and U-turn.",
  "Toxtricity": "Punk Rock ability with Overdrive, Sludge Bomb, Boomburst, and Volt Switch.",
  "Dragapult": "Fast mixed attacker with Dragon Darts, Shadow Ball, U-turn, and Thunderbolt or Flamethrower.",
  "Zeraora": "Physical sweeper with Plasma Fists, Close Combat, Knock Off, and Volt Switch.",
  "Urshifu": "Use Single Strike style with Wicked Blow, Close Combat, U-turn, and Poison Jab or Crunch.",
  "Darmanitan": "Zen Mode or standard with Flare Blitz, U-turn, Rock Slide, and Earthquake.",
  "Primarina": "Special attacker with Sparkling Aria, Moonblast, Calm Mind, and Rest.",
  "Kommo-o": "Mixed sets with Clangorous Soul, Close Combat, Flamethrower, and Poison Jab or Earthquake."
}